Text-Books/Fundamental-Algorithms/Chapter-0/chapter-0.html
<!DOCTYPE html>
<html>
<head>
<title>The Art of Computer Programming: Fundamental Algorithms ​[Chapter 0​]</title>
<!-- 2020-03-15 Sun 14:38 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="tatsu">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link href="http://taopeng.me/org-notes-style/css/notes.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">The Art of Computer Programming: Fundamental Algorithms ​[Chapter 0​]</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. ​Notes on the Exercises</a>
<ul>
<li><a href="#sec-1-1">1.1. Exercises</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. ​[00​] What does the rating "M20" mean?</a></li>
<li><a href="#sec-1-1-2">1.1.2. ​[10​] Of what value can the exercises in a text book be to the reader?</a></li>
<li><a href="#sec-1-1-3">1.1.3. ​[14​] Provethat 13<sup>3</sup> = 2197. Generalize your answer.</a></li>
<li><a href="#sec-1-1-4">1.1.4. ​[HM45​] Prove that when n is an integer, n &gt; 2, the equation x<sup>n</sup> + y<sup>n</sup> = z<sup>n</sup> has no solution in positive integers x, y, z.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
<a href="../fundamental-algorithms.html">Chapter List</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> ​Notes on the Exercises</h2>
<div class="outline-text-2" id="text-1">
<p>
This chapter is not of much importance. Knuth here simply explains effective ways to use the book and provides a key for his ratings of each problem:
</p>

<table>


<colgroup>
<col  class="right">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Code</th>
<th scope="col" class="left">Explanation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">M</td>
<td class="left">Mathematically oriented</td>
</tr>

<tr>
<td class="right">HM</td>
<td class="left">Requiring "higher math"</td>
</tr>

<tr>
<td class="right">00</td>
<td class="left">Immediate</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left">Simple (one minute)</td>
</tr>

<tr>
<td class="right">20</td>
<td class="left">Medium (quarter hour)</td>
</tr>

<tr>
<td class="right">30</td>
<td class="left">Moderately hard</td>
</tr>

<tr>
<td class="right">40</td>
<td class="left">Term project</td>
</tr>

<tr>
<td class="right">50</td>
<td class="left">Research problem</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Exercises</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> ​[00​] What does the rating "M20" mean?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
The M indicates that the problem is mathematically oriented. The 20 indicates that the problem is average and should take no more than fifteen to twenty minutes to solve.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> ​[10​] Of what value can the exercises in a text book be to the reader?</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
As Knuth specified earlier in this chapter, it is extremely difficult for the average reader to learn a subject by just reading about it. The value in having exercises will come from showing the reader specific applications of what was learned and to encourage further thinking on the topic.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> ​[14​] Prove<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> that 13<sup>3</sup> = 2197. Generalize your answer.</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<i>Proof of the proposition 13<sup>3</sup> = 2197:</i>
</p>

<p>
Previous knowledge applied: laws of exponents<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>, arithmetic<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>.
</p>

\begin{equation}
\begin{align*}
13^3 = 13^2 \cdot 13^1 \\
&= 13^1 \cdot 13^1 \cdot 13^1 \\
&= 13^1 \cdot 13^1 \cdot 13 \\
&= 13^1 \cdot 13 \cdot 13 \\
&= 13^1 \cdot 169 \\
&= 13 \cdot 169 \\
&= 2197
\end{align*}
\end{equation}

<p>
Therefore, 13<sup>3</sup> = 2197.
</p>

<p>
To generalize this answer, we can use capital pi notation<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup> and show that for all positive integers of n:
</p>

\begin{equation}
\prod_{i = 1}^{n} = x^n
\end{equation} 
</div>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> ​[HM45​] Prove that when n is an integer, n &gt; 2, the equation x<sup>n</sup> + y<sup>n</sup> = z<sup>n</sup> has no solution in positive integers x, y, z.</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
This is quite literally Fermat's Last Theorem; I will not even attempt to solve this just yet. Considering how long the actual proof is, this should be rated <i>at least</i> HM49.
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
For a guide on structuring proofs, there is a nice explanation by Eugenia Cheng which can be found <a href="https://deopurkar.github.io/teaching/algebra1/cheng.pdf">here</a>. Her website is <i>here</i>.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
The laws of exponents that we have used are:
</p>

\begin{equation}
x^1 = x
\end{equation}

<p class="footpara">
We have also used:
</p>

\begin{equation}
x^a \cdot x^b = x^{a+b}
\end{equation}</div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
Only addition and multiplication were used.
</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p class="footpara">
Capital pi notation simply means consecutive multiplication. A clear example would be:
</p>

\begin{equation}
\prod_{i = 1}^{4} = 1 \cdot 2 \cdot 3 \cdot 4
\end{equation}

<p class="footpara">
Which translates to:
</p>

\begin{equation}
\prod_{i = 1}^{4} = 24
\end{equation}</div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: tatsu</p>
<p class="date">Created: 2020-03-15 Sun 14:38</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
